const month = {
  1: 'البهاء',
  2: 'الجلال',
  3: 'الجمال',
  4: 'العظمة',
  5: 'النور',
  6: 'الرحمة',
  7: 'الكلمات',
  8: 'الكمال',
  9: 'الأسماء',
  10: 'العزّة',
  11: 'المشية',
  12: 'العلم',
  13: 'القدرة',
  14: 'القول',
  15: 'المسائل',
  16: 'الشرف',
  17: 'السلطان',
  18: 'الملك',
  19: 'العلاء',
  20: 'ايام الهاء'
};

const monthL = month;

const holyDay = {
  1: 'عيد النَّيروز',
  2: 'اليوم الأول من عيد الرِّضوان',
  3: 'اليوم التاسع من عيد الرِّضوان',
  4: 'اليوم الثاني عشر من عيد الرِّضوان',
  5: 'يوم إعلان دعوة حضرة الباب',
  6: 'يوم صعود حضرة بهاء الله',
  7: 'يوم استشهاد حضرة الباب',
  8: 'يوم ولادة حضرة الباب',
  9: 'يوم ولادة حضرة بهاء الله',
  10: 'يوم الميثاق',
  11: 'يوم صعود حضرة عبد البهاء'
};

const weekday = {
  1: 'الجلال',
  2: 'الجمال',
  3: 'الكمال',
  4: 'الفضّال',
  5: 'العدّال',
  6: 'الأستجلال',
  7: 'الاستقلال'
};

const weekdayAbbr3 = {
  1: 'جلا',
  2: 'جما',
  3: 'كما',
  4: 'فضّا',
  5: 'عدّا',
  6: 'اسج',
  7: 'اسق'
};

const weekdayAbbr2 = {
  1: 'جل',
  2: 'جم',
  3: 'كم',
  4: 'فض',
  5: 'عد',
  6: 'اج',
  7: 'اق'
};

const weekdayL = {
  1: 'الجلال',
  2: 'الجمال',
  3: 'الكمال',
  4: 'الفضّال',
  5: 'العدّال',
  6: 'الأستجلال',
  7: 'أستقلال'
};

const yearInVahid = {
  1: 'ألف',
  2: 'باء',
  3: 'أب',
  4: 'دﺍﻝ',
  5: 'باب',
  6: 'وﺍو',
  7: 'أبد',
  8: 'جاد',
  9: 'بهاء',
  10: 'حب',
  11: 'بهاج',
  12: 'جواب',
  13: 'احد',
  14: 'وﻫﺎب',
  15: 'وداد',
  16: 'بدیع',
  17: 'بهي',
  18: 'ابهى',
  19: 'واحد'
};

const vahid = 'واحد';
const kulliShay = 'كل شيء';
const BE = 'بديع';
const badiCalendar = 'تقويم بديع';
const digitUnicodeOffset = '٠'.charCodeAt(0);
const defaultFormat = '&#8207;d MM y BE&#8207;';

export {month, monthL, holyDay, weekday, weekdayAbbr3, weekdayAbbr2, weekdayL,
  yearInVahid, vahid, kulliShay, BE, badiCalendar, digitUnicodeOffset,
  defaultFormat};
