const month = {
  1: 'البهاء',
  2: 'الجلال',
  3: 'الجمال',
  4: 'العظمة',
  5: 'النور',
  6: 'الرحمة',
  7: 'الكلمات',
  8: 'الكمال',
  9: 'الأسماء',
  10: 'العزّة',
  11: 'المشية',
  12: 'العلم',
  13: 'القدرة',
  14: 'القول',
  15: 'المسائل',
  16: 'الشرف',
  17: 'السلطان',
  18: 'الملك',
  19: 'العلاء',
  20: 'ايام الهاء'
};

const monthL = {
  1: 'بهاء',
  2: 'جلال',
  3: 'جمال',
  4: 'عظمت',
  5: 'نور',
  6: 'رحمت',
  7: 'كلمات',
  8: 'كمال',
  9: 'أسماء',
  10: 'عزّت',
  11: 'مشيت',
  12: 'علم',
  13: 'قدرت',
  14: 'قول',
  15: 'مسائل',
  16: 'شرف',
  17: 'سلطان',
  18: 'ملك',
  19: 'علاء',
  20: 'ايام ها'
};

const holyDay = {
  1: 'عید نوروز',
  2: 'روز اوّل عید رضوان',
  3: 'روز نهم عید رضوان',
  4: 'روز دوازدهم عید رضوان',
  5: 'بعثت حضرت باب',
  6: 'صعود حضرت بهاالله',
  7: 'شهادت حضرت اعلی',
  8: 'تولّد حضرت اعلی',
  9: 'تولّد حضرت بهالله',
  10: 'روز عهد و میثاق',
  11: 'صعود حضرت عبدالبها'
};

const weekday = {
  1: 'یوم الجلال',
  2: 'یوم الجمال',
  3: 'یوم الكمال',
  4: 'یوم الفضّال',
  5: 'یوم العدّال',
  6: 'یوم الأستجلال',
  7: 'یوم الاستقلال'
};

const weekdayAbbr3 = {
  1: 'جلا',
  2: 'جما',
  3: 'كما',
  4: 'فضّا',
  5: 'عدّا',
  6: 'اسج',
  7: 'اسق'
};

const weekdayAbbr2 = {
  1: 'جل',
  2: 'جم',
  3: 'كم',
  4: 'فض',
  5: 'عد',
  6: 'اج',
  7: 'اق'
};

const weekdayL = {
  1: 'جلال',
  2: 'جمال',
  3: 'كمال',
  4: 'فضّال',
  5: 'عدّال',
  6: 'استجلال',
  7: 'استقلال'
};

const yearInVahid = {
  1: 'ألف',
  2: 'باء',
  3: 'أب',
  4: 'دﺍﻝ',
  5: 'باب',
  6: 'وﺍو',
  7: 'أبد',
  8: 'جاد',
  9: 'بهاء',
  10: 'حب',
  11: 'بهاج',
  12: 'جواب',
  13: 'احد',
  14: 'وﻫﺎب',
  15: 'وداد',
  16: 'بدیع',
  17: 'بهي',
  18: 'ابهى',
  19: 'واحد'
};

const BE = 'بديع';
const badiCalendar = 'تقويم بديع';

export {month, monthL, holyDay, weekday, weekdayAbbr3, weekdayAbbr2, weekdayL,
  yearInVahid, BE, badiCalendar};
