const month = {
    1: 'Бахā',
    2: 'Джалāл',
    3: 'Джамāл',
    4: '‘Аз̣амат',
    5: 'Нӯр',
    6: 'Рах̣мат',
    7: 'Калимāт',
    8: 'Камāл',
    9: 'Асмā’',
    10: '‘Иззат',
    11: 'Машӣййат',
    12: '‘Илм',
    13: 'К̣удрат',
    14: 'К̣аул',
    15: 'Масā’ил',
    16: 'Шараф',
    17: 'Султ̣ан',
    18: 'Мулк',
    19: '‘Алā’',
    20: 'Аййāм-и Хā',
};

const monthL = {
    1: 'Великолепие',
    2: 'Слава',
    3: 'Красота',
    4: 'Величие',
    5: 'Свет',
    6: 'Милость',
    7: 'Слова',
    8: 'Совершенство',
    9: 'Имена',
    10: 'Мощь',
    11: 'Воля',
    12: 'Знание',
    13: 'Могущество',
    14: 'Речь',
    15: 'Вопросы',
    16: 'Честь',
    17: 'Владычество',
    18: 'Господство',
    19: 'Возвышенность',
    20: 'Аййāм-и Хā',
};

const holyDay = {
    1: 'Нау-Рӯз',
    2: '1-й день Рид̣вāна',
    3: '9-й день Рид̣вāна',
    4: '12-й день Рид̣вāна',
    5: 'Возвещение Баба',
    6: 'Вознесение Бахауллы',
    7: 'Мученическая Баба',
    8: 'рождения Баба',
    9: 'рождения Бахауллы',
    10: 'День Завета',
    11: 'Вознесение Абдул-Баха',
};

const weekday = {
    1: 'Джалāл',
    2: 'Джамāл',
    3: 'Камāл',
    4: 'Фид̣āл',
    5: '‘Идāл',
    6: 'Истиджлāл',
    7: 'Истик̣лāл',
};

const weekdayAbbr3 = {
    1: 'Джл',
    2: 'Джм',
    3: 'Кам',
    4: 'Фид̣',
    5: '‘Идā',
    6: 'Исд',
    7: 'Иск̣',
};

const weekdayAbbr2 = {
    1: 'Дл',
    2: 'Дм',
    3: 'Ка',
    4: 'Фи',
    5: '‘Ид',
    6: 'Ид',
    7: 'Ик̣',
};

const weekdayL = {
    1: 'Слава',
    2: 'Красота',
    3: 'Совершенство',
    4: 'Благодать',
    5: 'Справедливость',
    6: 'Величие',
    7: 'Независимость',
};

const yearInVahid = {
    1: 'Алиф',
    2: 'Бā’',
    3: 'Аб',
    4: 'Дāл',
    5: 'Бāб',
    6: 'Вāв',
    7: 'Абад',
    8: 'Джāд',
    9: 'Бахā',
    10: 'Х̣убб',
    11: 'Баххāдж',
    12: 'Джавāб',
    13: 'Ах̣ад',
    14: 'Ваххāб',
    15: 'Видāд',
    16: 'Бадӣ‘',
    17: 'Бахӣ',
    18: 'Абхā',
    19: 'Вāх̣ид',
};

const vahid = 'Вāх̣ид';
const kulliShay = 'кулл-и шай’';
const BE = 'Э.Б.';
const badiCalendar = 'Календарь Бадӣ‘';

export { month, monthL, holyDay, weekday, weekdayAbbr3, weekdayAbbr2, weekdayL, yearInVahid, vahid, kulliShay, BE,
    badiCalendar };
