const month = {
  1: '巴哈',
  2: '贾拉勒',
  3: '贾迈勒',
  4: '阿泽迈特',
  5: '努尔',
  6: '拉赫迈特',
  7: '凯利马特',
  8: '卡迈勒',
  9: '艾斯玛',
  10: '伊扎特',
  11: '迈希耶特',
  12: '伊勒姆',
  13: '古德雷特',
  14: '高勒',
  15: '迈萨伊勒',
  16: '谢拉夫',
  17: '苏丹',
  18: '穆勒克',
  19: '阿拉',
  20: '阿亚米哈'
};

const monthL = {
  1: '耀',
  2: '辉',
  3: '美',
  4: '宏',
  5: '光',
  6: '仁',
  7: '言',
  8: '完',
  9: '名',
  10: '能',
  11: '意',
  12: '知',
  13: '力',
  14: '语',
  15: '问',
  16: '尊',
  17: '权',
  18: '统',
  19: '崇',
  20: '哈之日'
};

const holyDay = {
  1: '诺鲁孜节',
  2: '里兹万节第一日',
  3: '里兹万节第九日',
  4: '里兹万节第十二日',
  5: '巴孛宣示日',
  6: '巴哈欧拉升天日',
  7: '巴孛殉道日',
  8: '巴孛诞辰',
  9: '巴哈欧拉诞辰',
  10: '圣约日',
  11: '阿博都-巴哈升天日'
};

const weekday = {
  1: '贾拉勒',
  2: '贾迈勒',
  3: '卡迈勒',
  4: '菲达勒',
  5: '伊达勒',
  6: '伊斯提杰拉勒',
  7: '伊斯提格拉勒'
};

const weekdayAbbr3 = {
  1: '贾拉勒',
  2: '贾迈勒',
  3: '卡迈勒',
  4: '菲达勒',
  5: '伊达勒',
  6: '伊斯杰',
  7: '伊斯格'
};

const weekdayAbbr2 = {
  1: '贾拉',
  2: '贾迈',
  3: '卡迈',
  4: '菲达',
  5: '伊达',
  6: '伊杰',
  7: '伊格'
};

const weekdayL = {
  1: '辉日',
  2: '美日',
  3: '完日',
  4: '恩日',
  5: '正日',
  6: '威日',
  7: '独日'
};

const yearInVahid = {
  1: '艾利夫',
  2: '巴',
  3: '艾卜',
  4: '达勒',
  5: '巴卜',
  6: '瓦乌',
  7: '阿巴德',
  8: '贾德',
  9: '巴哈',
  10: '胡卜',
  11: '巴哈杰',
  12: '贾瓦卜',
  13: '阿哈德',
  14: '瓦哈卜',
  15: '维达德',
  16: '巴迪',
  17: '巴希',
  18: '阿卜哈',
  19: '瓦希德'
};

const vahid = '瓦希德';
const kulliShay = '库里沙伊';
const BE = 'BE';
const badiCalendar = '巴迪历';

export {month, monthL, holyDay, weekday, weekdayAbbr3, weekdayAbbr2, weekdayL,
  yearInVahid, vahid, kulliShay, BE, badiCalendar};
